In [3]:
import pandas as pd
import numpy as np
from pandas import DataFrame

In [4]:
number_df = DataFrame(np.arange(0,90,3).reshape(10,3), index = ['row 1', 'row 2', 'row 3', 'row 4', 'row 5', 'row 6', 'row 7', 'row 8', 'row 9', 'row 10'], columns = ['col 1', 'col 2', 'col 3'])

number_df

        col 1  col 2  col 3
row 1       0      3      6
row 2       9     12     15
row 3      18     21     24
row 4      27     30     33
row 5      36     39     42
row 6      45     48     51
row 7      54     57     60
row 8      63     66     69
row 9      72     75     78
row 10     81     84     87

In [5]:
number_df.iloc[0,1]

np.int64(3)

In [6]:
number_df.iloc[0,1] = 20
number_df

        col 1  col 2  col 3
row 1       0     20      6
row 2       9     12     15
row 3      18     21     24
row 4      27     30     33
row 5      36     39     42
row 6      45     48     51
row 7      54     57     60
row 8      63     66     69
row 9      72     75     78
row 10     81     84     87

In [8]:
number_df.iloc[[1,2,4],[1,2]]

       col 2  col 3
row 2     12     15
row 3     21     24
row 5     39     42

#Comparison operators(>, <, >=, <=, ==, !=)

In [9]:
mask = number_df > 30
mask

        col 1  col 2  col 3
row 1   False  False  False
row 2   False  False  False
row 3   False  False  False
row 4   False  False   True
row 5    True   True   True
row 6    True   True   True
row 7    True   True   True
row 8    True   True   True
row 9    True   True   True
row 10   True   True   True